
Notmuch WebUI - an interface to [[https://notmuchmail.org][notmuch]] mail indexing system.

**** NEXT hot reloading
     :LOGBOOK:
     CLOCK: [2025-03-08 Sat 18:32]--[2025-03-09 Sun 07:23] => 12:51
     - State "NEXT"       from "TODO"       [2025-03-07 Fri 20:15]
     - State "TODO"       from              [2025-03-07 Fri 20:15]
     :END:
 - [X] https://tonitalksdev.com/clojure-ring-hot-reloading-html-in-the-browser - Tried, does not work for me!?

**** DONE Selmer
     CLOSED: [2025-03-02 Sun 14:45]
     :LOGBOOK:
     - State "DONE"       from "WORKING"    [2025-03-02 Sun 14:45]
     CLOCK: [2025-03-02 Sun 14:38]--[2025-03-02 Sun 14:46] =>  0:08
     - State "WORKING"    from "TODO"       [2025-03-02 Sun 11:55]
     - State "TODO"       from              [2025-03-02 Sun 11:10]
     :END:

**** DONE data-star [3/3]
     CLOSED: [2025-03-02 Sun 15:25]
     :LOGBOOK:
     - State "DONE"       from "WORKING"    [2025-03-02 Sun 15:25]
     - State "WORKING"    from "TODO"       [2025-03-02 Sun 11:20]
     CLOCK: [2025-03-02 Sun 11:18]--[2025-03-02 Sun 11:55] =>  0:37
     - State "TODO"       from              [2025-03-02 Sun 11:10]
     :END:

 - [X] Frontend / code / package
 - [X] Rendering static
 - [X] Backend

**** Messgage list screen [47%]
     :LOGBOOK:
     CLOCK: [2025-03-08 Sat 18:16]--[2025-03-08 Sat 18:16] =>  0:00
     :END:
    
  The concepts of Server Side Events (SSE) allows us to assume that our screen is a function and we should re-render it depending on 
  the state on server.

***** DONE reset paginator current page to 1 on new search
      CLOSED: [2025-03-19 Wed 22:45]
      :LOGBOOK:
      - State "DONE"       from "WORKING"    [2025-03-19 Wed 22:45]
      - State "WORKING"    from "TODO"       [2025-03-19 Wed 21:55]
      CLOCK: [2025-03-19 Wed 21:56]--[2025-03-19 Wed 21:58] =>  0:02
      - State "TODO"       from              [2025-03-19 Wed 13:50]
      :END:

***** DONE fix issue with additional spaces
      CLOSED: [2025-03-14 Fri 20:35]
      :LOGBOOK:
      - State "DONE"       from "WORKING"    [2025-03-14 Fri 20:35]
      CLOCK: [2025-03-14 Fri 20:27]--[2025-03-14 Fri 20:35] =>  0:08
      - State "WORKING"    from "TODO"       [2025-03-14 Fri 20:25]
      - State "TODO"       from              [2025-03-14 Fri 20:25]
      :END:

***** WORKING use query arguments
      :LOGBOOK:
      CLOCK: [2025-03-10 Mon 07:32]--[2025-03-10 Mon 09:00] =>  1:28
      CLOCK: [2025-03-09 Sun 07:23]--[2025-03-09 Sun 12:57] =>  5:34
      CLOCK: [2025-03-08 Sat 18:16]--[2025-03-08 Sat 18:32] =>  0:16
      - State "WORKING"    from "TODO"       [2025-03-08 Sat 18:15]
      - State "TODO"       from              [2025-03-08 Sat 18:00]
      :END:

 - [X] use default query arguments
   - How to decode JSON params?
     - https://stackoverflow.com/questions/37397531/ring-read-body-of-a-http-request-as-string
     - 
 - [X] reload part of page on POST
 - [X] reload on SPC
 - [X] paginator page switch logic
 - [X] use paginator argument in rendering!
 - [ ] move out part of code with table to ~defn~!
 - [ ] make sure no code injection is possible due to edn/read!
 - +[ ] enter page number in paginator?+

***** DONE paginator via signal [0/3]
      CLOSED: [2025-03-19 Wed 22:55]
      :LOGBOOK:
      - State "DONE"       from "WORKING"    [2025-03-19 Wed 22:55]
      CLOCK: [2025-03-13 Thu 08:22]--[2025-03-13 Thu 09:20] =>  0:58
      - State "WORKING"    from "TODO"       [2025-03-13 Thu 08:20]
      - State "TODO"       from              [2025-03-13 Thu 08:20]
      :END:

 - [X] change page via signal
   - [X] use effect!
   - +[ ] measure load time!+
 - +[ ] change ... to avg!! and add label!+
 - [ ] adopt query string change

**** WORKING Display message screen [31%]
     :LOGBOOK:
     CLOCK: [2025-03-29 Sat 17:11]--[2025-03-29 Sat 17:20] =>  0:09
     CLOCK: [2025-03-20 Thu 07:57]--[2025-03-20 Thu 09:55] =>  1:58
     - State "WORKING"    from              [2025-03-20 Thu 07:55]
     :END:

***** DONE fix issue with 1st page render (its 2nd?)
      CLOSED: [2025-03-30 Sun 17:25]
      :LOGBOOK:
      - State "DONE"       from "TODO"       [2025-03-30 Sun 17:25]
      CLOCK: [2025-03-30 Sun 09:12]--[2025-03-30 Sun 10:22] =>  1:10
      - State "TODO"       from              [2025-03-30 Sun 09:10]
      :END:

***** DONE display text/plain [3/3]
      CLOSED: [2025-03-30 Sun 09:10]
      :LOGBOOK:
      - State "DONE"       from "WORKING"    [2025-03-30 Sun 09:10]
      CLOCK: [2025-03-29 Sat 22:21]--[2025-03-30 Sun 09:11] =>  9:50
      CLOCK: [2025-03-29 Sat 17:20]--[2025-03-29 Sat 22:21] =>  5:01
      CLOCK: [2025-03-29 Sat 17:10]--[2025-03-29 Sat 17:11] =>  0:01
      - State "WORKING"    from              [2025-03-29 Sat 17:10]
      :END:

 - [X] sanitize text - clean up all html tags
 - [X] replace links with a hrefs
 - [X] replace \n with <br>

***** DONE double check all content is present
      CLOSED: [2025-03-30 Sun 18:10]
      :LOGBOOK:
      - State "DONE"       from "WORKING"    [2025-03-30 Sun 18:10]
      CLOCK: [2025-03-30 Sun 17:54]--[2025-03-30 Sun 18:10] =>  0:16
      - State "WORKING"    from "REVIEW"     [2025-03-30 Sun 17:55]
      - State "REVIEW"     from              [2025-03-30 Sun 17:55]
      :END:

***** DONE add signals to show/hide parts of content
      CLOSED: [2025-04-04 Fri 20:55]
      :LOGBOOK:
      - State "DONE"       from "WORKING"    [2025-04-04 Fri 20:55]
      CLOCK: [2025-04-04 Fri 20:28]--[2025-04-04 Fri 20:56] =>  0:28
      - State "WORKING"    from "DONE"       [2025-04-04 Fri 19:55]
      - State "DONE"       from "WORKING"    [2025-04-04 Fri 19:55]
      CLOCK: [2025-04-03 Thu 08:30]--[2025-04-03 Thu 10:17] =>  1:47
      CLOCK: [2025-04-03 Thu 07:40]--[2025-04-03 Thu 08:00] =>  0:20
      CLOCK: [2025-04-02 Wed 21:48]--[2025-04-02 Wed 22:20] =>  0:32
      CLOCK: [2025-03-30 Sun 17:54]--[2025-03-30 Sun 17:54] =>  0:00
      - State "WORKING"    from "TODO"       [2025-03-30 Sun 17:55]
      - State "TODO"       from              [2025-03-29 Sat 17:15]
      :END:

 - [X] remove table, use columns
 - [X] use content, check responsive rendering
 - [X] add signals to hide/show based on message N + part N
 - [X] use nice icons to do this (triangle?)

***** TODO display text/html
      :LOGBOOK:
      CLOCK: [2025-04-04 Fri 20:56]--[2025-04-05 Sat 08:18] => 11:22
      - State "TODO"       from              [2025-03-29 Sat 17:10]
      :END:

 - [ ] safe filter?
 - [ ] embed images?
 - [ ] new window
 - [ ] iframe

***** WORKING First layout: vertical, like in emacs, mesages list
      :LOGBOOK:
      CLOCK: [2025-03-02 Sun 17:50]--[2025-03-02 Sun 18:00] =>  0:10
      - State "WORKING"    from "TODO"       [2025-03-02 Sun 17:50]
      - State "TODO"       from              [2025-03-02 Sun 17:25]
      :END:

 - [ ] Title
 - [ ] List of messages for this screen

